Documents/ESB/ESB_Consumer_0623/003TestSample/SAMPLE_XML_MUST/DebitCard/DC27_DbCardTxnAcidntDtlsModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardTxnAcidntDtlsModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardTxnAcidntDtlsMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardTxnAcidntDtlsModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC27</v11:TxnId>  
        <v11:TxnNo>DC2700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:BillNo>1000000001</v11:BillNo>  
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <v11:AdjAmt>12.0</v11:AdjAmt>  
        <v11:ChartAcct>STR</v11:ChartAcct>  
        <v11:UpdtUserId>joe</v11:UpdtUserId>  
        <v11:SprvsrlId>joe</v11:SprvsrlId> 
      </v11:ServiceBody> 
    </v11:DbCardTxnAcidntDtlsModRq> 
  </soap:Body> 
</soap:Envelope>
